@echo off
chcp 65001 >nul
mode con: cols=170 lines=39
goto banner
:banner
color d
echo.	
echo.
echo									██████╗ ██╗  ██╗ ██████╗ ██████╗ ██╗ █████╗ 
echo									██╔══██╗██║  ██║██╔═══██╗██╔══██╗██║██╔══██╗
echo									██████╔╝███████║██║   ██║██████╔╝██║███████║
echo									██╔═══╝ ██╔══██║██║   ██║██╔══██╗██║██╔══██║
echo									██║     ██║  ██║╚██████╔╝██████╔╝██║██║  ██║
echo									╚═╝     ╚═╝  ╚═╝ ╚═════╝ ╚═════╝ ╚═╝╚═╝  ╚═╝
echo											 Coded By Manu
echo					  ══════════════════════════════════════════════════════════════════════════════════════════════════════
echo.
echo 			          HACKING/ATTACKING                    GENERATORS/UTILS              IP TOOLS                    CREDITS          
echo.
echo				         [1] Wifi Cracker                     [5] Discord Nitro         [9] Ip to Hostname          [12] NameMC
echo				         [2] Ddos Tool                        [6] Discord ip puller     [10] Hostname to Ip         [13] Youtube
echo				         [3] Sniff Ip Addresses               [7] Ip                    [11] Port Scanner           [14] Github
echo                                  [4] Traces Ip Route                  [8] MyIp                  [*]Coming Soon..            [15] Telegram
echo.                                  
echo.                                  ══════════════════════════════════════════════════════════════════════════════════════════════════════
echo.
echo.
echo.
echo.
set /P choice=[37m[[31mUser[37m-([94mDESKTOP9U62DCG-Select[37m)]:
if "%choice%"=="1" goto 1
if "%choice%"=="2" goto 2
if "%choice%"=="3" goto 3
if "%choice%"=="4" goto 4
if "%choice%"=="5" goto 5
if "%choice%"=="6" goto 6
if "%choice%"=="7" goto 7
if "%choice%"=="8" goto 8
if "%choice%"=="9" goto 9
if "%choice%"=="10" goto 10
if "%choice%"=="11" goto 11
if "%choice%"=="12" goto 12
if "%choice%"=="13" goto 13
if "%choice%"=="14" goto 14
if "%choice%"=="15" goto 15
echo Invalid number, Press any key to continue
pause >nul
cls
goto banner

:1
cls
color 3
echo.
echo		██╗    ██╗██╗███████╗██╗ ██████╗██████╗  █████╗  ██████╗██╗  ██╗
echo		██║    ██║██║██╔════╝██║██╔════╝██╔══██╗██╔══██╗██╔════╝██║ ██╔╝
echo		██║ █╗ ██║██║█████╗  ██║██║     ██████╔╝███████║██║     █████╔╝ 
echo		██║███╗██║██║██╔══╝  ██║██║     ██╔══██╗██╔══██║██║     ██╔═██╗ 
echo		╚███╔███╔╝██║██║     ██║╚██████╗██║  ██║██║  ██║╚██████╗██║  ██╗
echo	 	 ╚══╝╚══╝ ╚═╝╚═╝     ╚═╝ ╚═════╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝
echo.
echo.
set /p input=Show avaibles wifi?(y/n):
if "%input%"=="y" goto wifi
if "%input%"=="n" goto wifino
:wifi
echo.
echo searching for wifies..
timeout /t 1 >nul
echo searching for wifies..
timeout /t 1 >nul
echo searching for wifies..
timeout /t 1 >nul
echo searching for wifies..
timeout /t 3 >nul
echo.
netsh wlan show profiles
echo.
set /p name=Select the wifi you want to crack (copy and paste the name):
color c
echo cracking password..
timeout /t 1 >nul
echo cracking password..
timeout /t 1 >nul
echo cracking password..
timeout /t 1 >nul
echo cracking password..
timeout /t 1 >nul
echo cracking password..
timeout /t 3 >nul
echo.
netsh wlan show profile name="%name%" key=clear
echo press any key to continue
pause >nul
cls
goto banner

:wifino
cls
goto banner


:2
color 6
cls
echo.
echo		████████╗██╗  ██╗███████╗	██████╗ ██╗██████╗ ██████╗ ███████╗██████╗ 
echo		╚══██╔══╝██║  ██║██╔════╝	██╔══██╗██║██╔══██╗██╔══██╗██╔════╝██╔══██╗
echo		   ██║   ███████║█████╗  	██████╔╝██║██████╔╝██████╔╝█████╗  ██████╔╝
echo		   ██║   ██╔══██║██╔══╝  	██╔══██╗██║██╔═══╝ ██╔═══╝ ██╔══╝  ██╔══██╗
echo		   ██║   ██║  ██║███████╗	██║  ██║██║██║     ██║     ███████╗██║  ██║
echo		   ╚═╝   ╚═╝  ╚═╝╚══════╝	╚═╝  ╚═╝╚═╝╚═╝     ╚═╝     ╚══════╝╚═╝  ╚═╝
echo.
echo.                                                      
set /p ddos=Write the server ip or the URL:
echo.
set /p packet=Write the packet size(max 255):
echo.
set /p message=Write message to the owner:
echo.
echo Attacking server %ddos% (press ctrl+c to stop the attack)... 
ping %Ddos% -i %packet% -t
echo.
echo Server attacked successfully, Press any key to continue.
pause >nul
cls
goto banner


:3
color b
cls
echo.
echo		███████╗███╗   ██╗██╗███████╗███████╗███████╗██████╗     ██╗   ██╗ ██╗
echo		██╔════╝████╗  ██║██║██╔════╝██╔════╝██╔════╝██╔══██╗    ██║   ██║███║
echo		███████╗██╔██╗ ██║██║█████╗  █████╗  █████╗  ██████╔╝    ██║   ██║╚██║
echo		╚════██║██║╚██╗██║██║██╔══╝  ██╔══╝  ██╔══╝  ██╔══██╗    ╚██╗ ██╔╝ ██║
echo		███████║██║ ╚████║██║██║     ██║     ███████╗██║  ██║     ╚████╔╝  ██║
echo		╚══════╝╚═╝  ╚═══╝╚═╝╚═╝     ╚═╝     ╚══════╝╚═╝  ╚═╝      ╚═══╝   ╚═╝
echo.
echo.
echo Start sniffing? Press enter if so.
set /p input=
echo.
echo Searching for ip's...
timeout /t 1 >nul
echo Searching for ip's...
timeout /t 2 >nul
echo.
echo Press ctrl+c to stop capturing.
netstat
echo Press any key to go back.
pause >nul
cls
goto banner

:4
color 2
cls
echo.
echo		████████╗██████╗  █████╗  ██████╗███████╗██████╗     ██╗   ██╗ ██╗
echo		╚══██╔══╝██╔══██╗██╔══██╗██╔════╝██╔════╝██╔══██╗    ██║   ██║███║
echo		   ██║   ██████╔╝███████║██║     █████╗  ██████╔╝    ██║   ██║╚██║
echo		   ██║   ██╔══██╗██╔══██║██║     ██╔══╝  ██╔══██╗    ╚██╗ ██╔╝ ██║
echo		   ██║   ██║  ██║██║  ██║╚██████╗███████╗██║  ██║     ╚████╔╝  ██║
echo		   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚══════╝╚═╝  ╚═╝      ╚═══╝   ╚═╝
echo.
echo.
set /p tracer=Enter the ip/url you want to trace:
echo.
echo Starting..(Press ctrl+c to stop tracing)
tracert %tracer%
echo Press any key to go back
pause>nul
cls
goto banner

:5
cls
set discord=https://discord.com/gifts/
set /a number1=%random%
set /a number2=%random%
set /a number3=%random%
set /a number4=%random%
set /a number5=%random%
set /a number6=%random%
set /a number7=%random%
set /a number8=%random%
echo.[95m 
echo 	███╗   ██╗██╗████████╗██████╗  ██████╗      ██████╗ ███████╗███╗   ██╗███████╗██████╗  █████╗ ████████╗ ██████╗ ██████╗ 
echo		████╗  ██║██║╚══██╔══╝██╔══██╗██╔═══██╗    ██╔════╝ ██╔════╝████╗  ██║██╔════╝██╔══██╗██╔══██╗╚══██╔══╝██╔═══██╗██╔══██╗
echo		██╔██╗ ██║██║   ██║   ██████╔╝██║   ██║    ██║  ███╗█████╗  ██╔██╗ ██║█████╗  ██████╔╝███████║   ██║   ██║   ██║██████╔╝
echo		██║╚██╗██║██║   ██║   ██╔══██╗██║   ██║    ██║   ██║██╔══╝  ██║╚██╗██║██╔══╝  ██╔══██╗██╔══██║   ██║   ██║   ██║██╔══██╗
echo		██║ ╚████║██║   ██║   ██║  ██║╚██████╔╝    ╚██████╔╝███████╗██║ ╚████║███████╗██║  ██║██║  ██║   ██║   ╚██████╔╝██║  ██║
echo		╚═╝  ╚═══╝╚═╝   ╚═╝   ╚═╝  ╚═╝ ╚═════╝      ╚═════╝ ╚══════╝╚═╝  ╚═══╝╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝    ╚═════╝ ╚═╝  ╚═╝
echo.
echo.
echo Start Generating? Press enter if so.
set /p input=
echo.
echo %discord%%number1%
timeout /t 1 >nul
echo %discord%%number2%
timeout /t 1 >nul    
echo %discord%%number3%
timeout /t 1 >nul    
echo %discord%%number4%
timeout /t 1 >nul    
echo %discord%%number5%
timeout /t 1 >nul    
echo %discord%%number6%
timeout /t 1 >nul    
echo %discord%%number7%
timeout /t 1 >nul    
echo %discord%%number8%
timeout /t 3 >nul      
echo URL Generated. Press any key to continue
pause >nul
cls
goto banner       

:6
color e
cls
echo.
echo		██████╗ ██╗███████╗ ██████╗ ██████╗ ██████╗ ██████╗     ██████╗ ██╗   ██╗██╗     ██╗     ███████╗██████╗     ██╗   ██╗ ██╗
echo		██╔══██╗██║██╔════╝██╔════╝██╔═══██╗██╔══██╗██╔══██╗    ██╔══██╗██║   ██║██║     ██║     ██╔════╝██╔══██╗    ██║   ██║███║
echo		██║  ██║██║███████╗██║     ██║   ██║██████╔╝██║  ██║    ██████╔╝██║   ██║██║     ██║     █████╗  ██████╔╝    ██║   ██║╚██║
echo		██║  ██║██║╚════██║██║     ██║   ██║██╔══██╗██║  ██║    ██╔═══╝ ██║   ██║██║     ██║     ██╔══╝  ██╔══██╗    ╚██╗ ██╔╝ ██║
echo		██████╔╝██║███████║╚██████╗╚██████╔╝██║  ██║██████╔╝    ██║     ╚██████╔╝███████╗███████╗███████╗██║  ██║     ╚████╔╝  ██║
echo		╚═════╝ ╚═╝╚══════╝ ╚═════╝ ╚═════╝ ╚═╝  ╚═╝╚═════╝     ╚═╝      ╚═════╝ ╚══════╝╚══════╝╚══════╝╚═╝  ╚═╝      ╚═══╝   ╚═╝   
echo.
echo.
set /a ip1=%random% %% 256
set /a ip2=%random% %% 256
set /a ip3=%random% %% 256
set /a ip4=%random% %% 256

set /p ip=Enter the username of the User:
echo Searching for the ip..
timeout /t 1 >nul
echo Searching for the ip..
timeout /t 1 >nul
echo Searching for the ip..
timeout /t 1 >nul
echo Searching for the ip..
timeout /t 1 >nul
echo Searching for the ip..
timeout /t 2 >nul
echo the Ip of %ip% is %ip1%.%ip2%.%ip3%.%ip4%
pause >nul
cls
goto banner    

:7
color 9
cls
echo.
echo		██╗██████╗      ██████╗ ███████╗███╗   ██╗    ██╗   ██╗ ██╗
echo		██║██╔══██╗    ██╔════╝ ██╔════╝████╗  ██║    ██║   ██║███║
echo		██║██████╔╝    ██║  ███╗█████╗  ██╔██╗ ██║    ██║   ██║╚██║
echo		██║██╔═══╝     ██║   ██║██╔══╝  ██║╚██╗██║    ╚██╗ ██╔╝ ██║
echo		██║██║         ╚██████╔╝███████╗██║ ╚████║     ╚████╔╝  ██║
echo		╚═╝╚═╝          ╚═════╝ ╚══════╝╚═╝  ╚═══╝      ╚═══╝   ╚═╝
echo.
echo.
set /a ip1=%random% %% 256
set /a ip2=%random% %% 256
set /a ip3=%random% %% 256
set /a ip4=%random% %% 256

echo Press enter to start generating..
set /p input=
echo %ip1%.%ip2%.%ip2%.%ip4%
timeout /t 1 >nul
echo %ip2%.%ip4%.%ip1%.%ip4%
timeout /t 1 >nul
echo %ip3%.%ip2%.%ip4%.%ip4%
timeout /t 1 >nul
echo %ip4%.%ip2%.%ip3%.%ip4%
timeout /t 1 >nul
echo %ip2%.%ip1%.%ip4%.%ip3%
timeout /t 1 >nul
echo %ip4%.%ip3%.%ip2%.%ip4%
timeout /t 1 >nul
echo %ip3%.%ip4%.%ip2%.%ip4%
timeout /t 1 >nul
echo %ip1%.%ip2%.%ip3%.%ip4%
timeout /t 1 >nul
echo %ip2%.%ip3%.%ip2%.%ip4%
timeout /t 1 >nul
echo %ip4%.%ip3%.%ip1%.%ip4%
timeout /t 1 >nul
echo ip's generated. Press any key to go back.
pause >nul
cls
goto banner  

:8
color 5
cls
echo.
echo		███╗   ███╗██╗   ██╗██╗██████╗ 
echo		████╗ ████║╚██╗ ██╔╝██║██╔══██╗
echo		██╔████╔██║ ╚████╔╝ ██║██████╔╝
echo		██║╚██╔╝██║  ╚██╔╝  ██║██╔═══╝ 
echo		██║ ╚═╝ ██║   ██║   ██║██║     
echo		╚═╝     ╚═╝   ╚═╝   ╚═╝╚═╝     
echo.
echo.
nslookup myip.opendns.com resolver1.opendns.com
echo Press any key to get back.
pause >nul
cls
goto banner

:9
color 4
cls
echo.
echo		██╗  ██╗ ██████╗ ███████╗████████╗███╗   ██╗ █████╗ ███╗   ███╗███████╗    ███████╗██╗███╗   ██╗██████╗ ███████╗██████╗ 
echo		██║  ██║██╔═══██╗██╔════╝╚══██╔══╝████╗  ██║██╔══██╗████╗ ████║██╔════╝    ██╔════╝██║████╗  ██║██╔══██╗██╔════╝██╔══██╗
echo		███████║██║   ██║███████╗   ██║   ██╔██╗ ██║███████║██╔████╔██║█████╗      █████╗  ██║██╔██╗ ██║██║  ██║█████╗  ██████╔╝
echo		██╔══██║██║   ██║╚════██║   ██║   ██║╚██╗██║██╔══██║██║╚██╔╝██║██╔══╝      ██╔══╝  ██║██║╚██╗██║██║  ██║██╔══╝  ██╔══██╗
echo		██║  ██║╚██████╔╝███████║   ██║   ██║ ╚████║██║  ██║██║ ╚═╝ ██║███████╗    ██║     ██║██║ ╚████║██████╔╝███████╗██║  ██║
echo		╚═╝  ╚═╝ ╚═════╝ ╚══════╝   ╚═╝   ╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝    ╚═╝     ╚═╝╚═╝  ╚═══╝╚═════╝ ╚══════╝╚═╝  ╚═╝
echo.
echo.
set /p hostname=Enter the ip:
echo.
echo Finding Hostname..
timeout /t 1 >nul
echo Finding Hostname..
timeout /t 1 >nul 
echo Finding Hostname..
timeout /t 1 >nul 
echo Finding Hostname..
timeout /t 2 >nul
nslookup %Hostname%
pause >nul
cls
goto banner

:10
color 4
cls
echo.
echo		██╗  ██╗ ██████╗ ███████╗████████╗███╗   ██╗ █████╗ ███╗   ███╗███████╗    ████████╗ ██████╗     ██╗██████╗ 
echo		██║  ██║██╔═══██╗██╔════╝╚══██╔══╝████╗  ██║██╔══██╗████╗ ████║██╔════╝    ╚══██╔══╝██╔═══██╗    ██║██╔══██╗
echo		███████║██║   ██║███████╗   ██║   ██╔██╗ ██║███████║██╔████╔██║█████╗         ██║   ██║   ██║    ██║██████╔╝
echo		██╔══██║██║   ██║╚════██║   ██║   ██║╚██╗██║██╔══██║██║╚██╔╝██║██╔══╝         ██║   ██║   ██║    ██║██╔═══╝ 
echo		██║  ██║╚██████╔╝███████║   ██║   ██║ ╚████║██║  ██║██║ ╚═╝ ██║███████╗       ██║   ╚██████╔╝    ██║██║     
echo		╚═╝  ╚═╝ ╚═════╝ ╚══════╝   ╚═╝   ╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝       ╚═╝    ╚═════╝     ╚═╝╚═╝                                                                                                          
echo.
echo.
set /p hostname2=Enter the hostname:
echo.
echo Finding ip..
timeout /t 1 >nul
echo Finding ip..
timeout /t 1 >nul 
echo Finding ip..
timeout /t 1 >nul 
echo Finding ip..
timeout /t 2 >nul
nslookup %Hostname2%
pause >nul
cls
goto banner                                                                                        

:11
color e
cls
echo.
echo		███████╗██╗  ██╗███████╗██████╗ ██╗      ██████╗  ██████╗██╗  ██╗
echo		██╔════╝██║  ██║██╔════╝██╔══██╗██║     ██╔═══██╗██╔════╝██║ ██╔╝
echo		███████╗███████║█████╗  ██████╔╝██║     ██║   ██║██║     █████╔╝ 
echo		╚════██║██╔══██║██╔══╝  ██╔══██╗██║     ██║   ██║██║     ██╔═██╗ 
echo		███████║██║  ██║███████╗██║  ██║███████╗╚██████╔╝╚██████╗██║  ██╗
echo		╚══════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝╚══════╝ ╚═════╝  ╚═════╝╚═╝  ╚═╝
echo.
echo.
echo Start Scanning? Press enter if so.
set /p input=
echo.
echo Searching for ports..
timeout /t 1 >nul
echo Searching for ports..
timeout /t 1 >nul
echo Searching for ports..
timeout /t 1 >nul
echo Searching for ports..
timeout /t 1 >nul
echo Searching for ports..
timeout /t 3 >nul
echo Port found! Press ctrl+c to stop listening
timeout /t 3 >nul
netstat -a
pause >nul
cls
goto banner

:12
cls
color b
echo Follow me on Namemc! https://it.namemc.com/profile/adjudged.1
pause >nul
cls
goto banner

:13
cls
color b
echo Subscribe to my youtube! https://www.youtube.com/@ManuProducerr
pause >nul
cls
goto banner

:14
cls
color b
echo See my work on github! https://github.com/ManuProducer
pause >nul
cls
goto banner

:15
cls
color b
echo For any questions, contact me on telegram: @piiiagers
pause >nul
cls
goto banner